{"schema_version":3,"name":"Azure Sentinel","description":null,"guid":"fb3a3dd54281528d0ef0464b90b8ba6f","exported_at":"2021-01-28T15:33:05Z","agents":[{"type":"Agents::HTTPRequestAgent","name":"Renew Subscription","disabled":false,"guid":"02a611149bb7fdb3e2f09f8b5195815d","options":{"content_type":"json","headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[],"method":"patch","payload":{"expirationDateTime":"{{ \"now\" | date: \"%s\" | plus: 240000 | date: \"%Y-%m-%dT%H:%M:%S.%H%M%d0Z\" }}"},"url":"https://graph.microsoft.com/v1.0/subscriptions/{{ .RESOURCE.microsoft_graph_subscriptionid }}"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Create a Text Global Resource","disabled":false,"guid":"7707813b00c133bb8d4f59b484ee4784","options":{"content_type":"json","headers":{"x-user-email":"{{ .RESOURCE.tines_email }}","x-user-token":"{{ .CREDENTIAL.tines_token }}"},"method":"post","payload":{"name":"microsoft_graph_subscriptionid","team_id":"8","value":"{{ .set_up_subscription.body.id }}","value_type":"text"},"url":"https://{{ .RESOURCE.tines_domain }}/api/v1/global_resources"},"schedule":null,"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Exit STS","disabled":false,"guid":"70f368629559e5d195289e45c2d5d7bd","options":{"mode":"message_only","payload":{"result":"{{ .create_json_from_dataframe.json | json_parse | as_object  }}"}},"keep_events_for":0},{"type":"Agents::SendToStoryAgent","name":"Send to Story Agent","disabled":false,"guid":"2ba1db9d7c46eb341138d3c843f6e8ee","options":{"payload":{"query":"SecurityAlert | where TimeGenerated >= ago(7d)"},"story":"{% story Azure Sentinel Storyboard%}"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Set Up Subscription","disabled":false,"guid":"1b4fcf9b8931dac2df6a2a45b4aef88f","options":{"content_type":"json","headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[],"method":"post","payload":{"changeType":"updated","clientState":"SecretClientState","expirationDateTime":"{{ \"now\" | date: \"%s\" | plus: 240000 | date: \"%Y-%m-%dT%H:%M:%S.%H%M%d0Z\" }}","notificationUrl":"https://{{ .RESOURCE.tines_domain }}/webhook/830205ac2d7c6012581758b2aa70716c/de9cb2b6f54dd6e008e53f5ec748caa3","resource":"security/alerts/?$filter=status eq 'NewAlert'"},"url":"https://graph.microsoft.com/v1.0/subscriptions"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Delete Subscription","disabled":false,"guid":"5e63ee40739d6fc56a7231188300db6a","options":{"content_type":"json","headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[],"method":"delete","url":"https://graph.microsoft.com/v1.0/subscriptions/{{.RESOURCE.microsoft_graph_subscriptionid }}"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Authenticate to LogAnalytics","disabled":false,"guid":"b36e5830d15e73de00cefd4b63fd8d14","options":{"content-type":"form","headers":{"user-agent":"Tines"},"method":"post","payload":{"client_id":"{{ client_id }}","client_secret":"{{ client_secret }}","grant_type":"client_credentials","resource":"https://api.loganalytics.io"},"url":"https://login.microsoftonline.com/{{ azure_tenant_id }}/oauth2/token"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Retrieve Alerts using the MSGraph Security API","disabled":false,"guid":"a5b9fefa28e6c0af478674f292b1d727","options":{"headers":{"Authorization":"Bearer {{ .CREDENTIAL.msgraph }}"},"method":"get","url":"https://graph.microsoft.com/v1.0/security/alerts"},"schedule":null,"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Explode Alerts","disabled":false,"guid":"da3612dc9428c92d5f552f108ababdcb","options":{"mode":"explode","path":"{{.receive_alerts.value}}","to":"alert"},"keep_events_for":0},{"type":"Agents::TriggerAgent","name":"Check for Alerts","disabled":false,"guid":"8ae92d0e248d9eebde0cc7d6079ee2eb","options":{"rules":[{"path":"{{ .receive_alerts.value }}","type":"!regex","value":"^$"}]},"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Create JSON from Dataframe","disabled":false,"guid":"fa8816d0575e5faf078a94ad0282d67c","options":{"mode":"message_only","payload":{"json":"{% assign keys = .query_loganalytics.body.tables[0] | jsonpath: '$.columns[*].name' %}[{% for row in .query_loganalytics.body.tables[0].rows %}{ {% for data in row %} \"{{ keys[forloop.index0] }}\": \"{{ row[forloop.index0] | escape | strip_newlines }}\"{% if forloop.last == false %},{% endif %}{% endfor %}}{% if forloop.last == false %},{% endif %}{% endfor %}]"}},"keep_events_for":0},{"type":"Agents::WebhookAgent","name":"Receive Alerts","disabled":false,"guid":"c2de9314be341d6bcf2f43ea51d13c70","options":{"include_headers":"false","response":"{{.validationToken}}","response_code":"200","secret":"de9cb2b6f54dd6e008e53f5ec748caa3","verbs":"get,post"},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Query LogAnalytics","disabled":false,"guid":"0fc05926061e094099041022ad9b1453","options":{"content_type":"json","headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_log_analytics }}"},"method":"post","payload":{"query":"{{ .receive_query.body.query }}"},"url":"https://api.loganalytics.io/v1/workspaces/{{ .RESOURCE.microsoft_log_analytics_workspace}}/query"},"schedule":null,"keep_events_for":0},{"type":"Agents::WebhookAgent","name":"Receive Query","disabled":false,"guid":"0913ea75e120446e5c8038f3a4032182","options":{"secret":"75a96adec670533245038fd04274de2e","verbs":"get,post"},"keep_events_for":0}],"links":[{"source":4,"receiver":1},{"source":8,"receiver":7},{"source":9,"receiver":8},{"source":10,"receiver":2},{"source":11,"receiver":9},{"source":12,"receiver":10},{"source":13,"receiver":12}],"diagram_layout":"{\"0913ea75e120446e5c8038f3a4032182\":[120,-405],\"c2de9314be341d6bcf2f43ea51d13c70\":[360,-405],\"8ae92d0e248d9eebde0cc7d6079ee2eb\":[360,-270],\"0fc05926061e094099041022ad9b1453\":[120,-270],\"da3612dc9428c92d5f552f108ababdcb\":[360,-165],\"1b4fcf9b8931dac2df6a2a45b4aef88f\":[600,-405],\"fa8816d0575e5faf078a94ad0282d67c\":[120,-165],\"01abfcdb99a742128d1f3fb19a67dea0\":[600,-645],\"a5b9fefa28e6c0af478674f292b1d727\":[360,-45],\"b36e5830d15e73de00cefd4b63fd8d14\":[1080,-405],\"5e63ee40739d6fc56a7231188300db6a\":[1320,-405],\"2ba1db9d7c46eb341138d3c843f6e8ee\":[1530,-405],\"70f368629559e5d195289e45c2d5d7bd\":[120,-45],\"7707813b00c133bb8d4f59b484ee4784\":[600,-270],\"02a611149bb7fdb3e2f09f8b5195815d\":[840,-405]}","send_to_story_enabled":false,"entry_agent_guid":null,"exit_agent_guids":[],"exit_agent_guid":null,"send_to_stories":[{"schema_version":3,"name":"Azure Sentinel Storyboard","description":null,"guid":"22580556921339741ef5a3f12d37e30e","exported_at":"2021-01-28T15:33:05Z","agents":[{"type":"Agents::WebhookAgent","name":"Receive Microsoft Graph Subscription Notifications","disabled":false,"guid":"14e8c89b748d7ca2e4422e6fc986d796","options":{"secret":"de9cb2b6f54dd6e008e53f5ec748caa3","verbs":"get,post","response_code":"200","response":"{{.validationToken}}","include_headers":"false"},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Create Threat Indicator in Microsoft Graph","disabled":false,"guid":"196017c0b51004d0f338dfb732df2d4d","options":{"url":"https://graph.microsoft.com/beta/security/tiIndicators","content_type":"json","method":"post","headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_graph}}","User-Agent":"Tines"},"payload":{"action":"alert","activityGroupNames":[],"confidence":0,"description":"This is a demo indicator","expirationDateTime":"2019-03-01T21:43:37.5031462+00:00","externalId":"Test--Tines","fileHashType":"sha256","fileHashValue":"aa64428647b57bf51524d1756b2ed746e5a3f31b67cf7fe5b5d8a9daf07ca314","killChain":[],"malwareFamilyNames":[],"severity":0,"tags":[],"targetProduct":"Azure Sentinel","threatType":"WatchList","tlpLevel":"green"}},"schedule":null,"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Create JSON from Dataframe","disabled":false,"guid":"c40846357937b39fe71b4ed4a71d794e","options":{"mode":"message_only","payload":{"json":"{% assign keys = .query_azure_loganalytics.body.tables[0] | jsonpath: '$.columns[*].name' %}[{% for row in .query_azure_loganalytics.body.tables[0].rows %}{ {% for data in row %} \"{{ keys[forloop.index0] }}\": \"{{ row[forloop.index0] | escape | strip_newlines }}\"{% if forloop.last == false %},{% endif %}{% endfor %}}{% if forloop.last == false %},{% endif %}{% endfor %}]"}},"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Exit STS","disabled":false,"guid":"be6b98ad5eec3c168fda0e86a8249e53","options":{"mode":"message_only","payload":{"result":"{{ .create_json_from_dataframe.json | json_parse | as_object  }}"}},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Create Threat Indicator in Microsoft Graph","disabled":false,"guid":"fce9f8f2bbc2c4888e52d03afd0fa341","options":{"url":"https://graph.microsoft.com/beta/security/tiIndicators","content_type":"json","method":"post","headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_graph}}","User-Agent":"Tines"},"payload":{"action":"alert","activityGroupNames":[],"confidence":0,"description":"This is a canary indicator for demo purpose. Take no action on any observables set in this indicator.","expirationDateTime":"2019-03-01T21:43:37.5031462+00:00","externalId":"Test--1234124","networkSourceIPv4":"123.123.123.124","killChain":[],"malwareFamilyNames":[],"severity":0,"tags":[],"targetProduct":"Azure Sentinel","threatType":"WatchList","tlpLevel":"green","name":"testing "}},"schedule":null,"keep_events_for":0},{"type":"Agents::TriggerAgent","name":"Check for Alerts","disabled":false,"guid":"c2e8a7c23dd1f82c8ff3bd967950e358","options":{"rules":[{"type":"!regex","value":"^$","path":"{{ .receive_alerts.value }}"}]},"keep_events_for":0},{"type":"Agents::EventTransformationAgent","name":"Explode Alerts","disabled":false,"guid":"0ef75404e3ec803c1a7eaa0a635d89a4","options":{"mode":"explode","path":"{{.receive_alerts.value}}","to":"alert"},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Retrieve Alerts using the MSGraph Security API","disabled":false,"guid":"fa391cd579038712bb2b4e9e4aafd91c","options":{"url":"https://graph.microsoft.com/v1.0/security/alerts/{{.explode_alerts.alert.resourceData.id}}","method":"get","headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_graph}}","User-Agent":"Tines"}},"schedule":null,"keep_events_for":0},{"type":"Agents::SendToStoryAgent","name":"Send to Story Agent","disabled":false,"guid":"9734a6288d30de3b320348c6f485adf7","options":{"story":"{% story Azure Sentinel Storyboard%}","payload":{"query":"AWSCloudTrail\n| where EventName =~ \"ConsoleLogin\"\n| where UserIdentityType =~ \"Root\"\n| extend AccountCustomEntity = UserIdentityUserName\n| extend IPCustomEntity = SourceIpAddress"}},"schedule":null,"keep_events_for":0},{"type":"Agents::WebhookAgent","name":"Receive Query","disabled":false,"guid":"ef0a9cb69b824154d1518770b7491b5d","options":{"secret":"75a96adec670533245038fd04274de2e","verbs":"get,post"},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Create a Text Global Resource","disabled":false,"guid":"b65ded8f263bb168a51951e59c4de1bf","options":{"url":"https://{{ .RESOURCE.tines_domain }}/api/v1/global_resources","content_type":"json","method":"post","payload":{"name":"microsoft_graph_subscriptionid","value_type":"text","value":"{{ .set_up_subscription.body.id }}","team_id":"8"},"headers":{"x-user-email":"{{ .RESOURCE.tines_email }}","x-user-token":"{{ .CREDENTIAL.tines_token }}"}},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Delete Subscription","disabled":false,"guid":"4587fdeff709388f64cfe91296abd947","options":{"url":"https://graph.microsoft.com/v1.0/subscriptions/{{.RESOURCE.microsoft_graph_subscriptionid }}","content_type":"json","method":"delete","headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[]},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Authenticate to LogAnalytics","disabled":false,"guid":"46aa40f531743099d2b519acf8e481cb","options":{"url":"https://login.microsoftonline.com/{{ azure_tenant_id }}/oauth2/token","method":"post","payload":{"client_id":"{{ client_id }}","grant_type":"client_credentials","client_secret":"{{ client_secret }}","resource":"https://api.loganalytics.io"},"headers":{"user-agent":"Tines"},"content-type":"form"},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Set Up Subscription","disabled":false,"guid":"8d2f08096f78df22808d5a4a07684fa1","options":{"url":"https://graph.microsoft.com/v1.0/subscriptions","content_type":"json","method":"post","payload":{"changeType":"updated","notificationUrl":"https://{{ .RESOURCE.tines_domain }}/webhook/830205ac2d7c6012581758b2aa70716c/de9cb2b6f54dd6e008e53f5ec748caa3","resource":"security/alerts/?$filter=status eq 'NewAlert'","expirationDateTime":"{{ \"now\" | date: \"%s\" | plus: 240000 | date: \"%Y-%m-%dT%H:%M:%S.%H%M%d0Z\" }}","clientState":"SecretClientState"},"headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[]},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Renew Subscription","disabled":false,"guid":"d0dd8241e2eb04f1ef2fab7b12a62503","options":{"url":"https://graph.microsoft.com/v1.0/subscriptions/{{ .RESOURCE.microsoft_graph_subscriptionid }}","content_type":"json","method":"patch","payload":{"expirationDateTime":"{{ \"now\" | date: \"%s\" | plus: 240000 | date: \"%Y-%m-%dT%H:%M:%S.%H%M%d0Z\" }}"},"headers":{"Authorization":"Bearer {% credential microsoft_graph %}"},"log_error_on_status":[]},"schedule":[{"cron":"0 */6 * * *","timezone":"America/Chicago"}],"keep_events_for":0},{"type":"Agents::WebhookAgent","name":"Receive Alerts","disabled":false,"guid":"830205ac2d7c6012581758b2aa70716c","options":{"secret":"de9cb2b6f54dd6e008e53f5ec748caa3","verbs":"get,post","response_code":"200","response":"{{.validationToken}}","include_headers":"false"},"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Query Azure LogAnalytics","disabled":false,"guid":"8b424316f6444edb1336faea2ef4d364","options":{"url":"https://api.loganalytics.io/v1/workspaces/{{ .RESOURCE.microsoft_log_analytics_workspace}}/query","content_type":"json","method":"post","payload":{"query":"{{ query }}"},"headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_log_analytics }}"}},"schedule":null,"keep_events_for":0},{"type":"Agents::HTTPRequestAgent","name":"Create Microsoft Graph API Subscription For Security Alerts","disabled":false,"guid":"2a4de1c4e6095d1acb38c0eb608c9ac3","options":{"url":"https://graph.microsoft.com/v1.0/subscriptions","content_type":"json","method":"post","payload":{"changeType":"updated","notificationUrl":"{{ webhook_url }}","resource":"security/alerts/?$filter=status eq 'NewAlert'","expirationDateTime":"{{ \"now\" | date: \"%s\" | plus: 240000 | date: \"%Y-%m-%dT%H:%M:%S.%H%M%d0Z\" }}","clientState":"SecretClientState"},"headers":{"Authorization":"Bearer {{ .CREDENTIAL.microsoft_graph }}"}},"schedule":null,"keep_events_for":0}],"links":[{"source":2,"receiver":3},{"source":5,"receiver":6},{"source":6,"receiver":7},{"source":9,"receiver":16},{"source":13,"receiver":10},{"source":15,"receiver":5},{"source":16,"receiver":2}],"diagram_layout":"{\"196017c0b51004d0f338dfb732df2d4d\":[-720,-225],\"c40846357937b39fe71b4ed4a71d794e\":[-180,-150],\"8b424316f6444edb1336faea2ef4d364\":[-180,-270],\"be6b98ad5eec3c168fda0e86a8249e53\":[-180,-45],\"fce9f8f2bbc2c4888e52d03afd0fa341\":[-1410,-270],\"fa391cd579038712bb2b4e9e4aafd91c\":[105,-45],\"c2e8a7c23dd1f82c8ff3bd967950e358\":[105,-270],\"0ef75404e3ec803c1a7eaa0a635d89a4\":[105,-150],\"830205ac2d7c6012581758b2aa70716c\":[105,-390],\"9734a6288d30de3b320348c6f485adf7\":[-435,-390],\"ef0a9cb69b824154d1518770b7491b5d\":[-180,-390],\"b65ded8f263bb168a51951e59c4de1bf\":[840,-285],\"4587fdeff709388f64cfe91296abd947\":[1080,-390],\"46aa40f531743099d2b519acf8e481cb\":[-1275,-375],\"8d2f08096f78df22808d5a4a07684fa1\":[840,-390],\"d0dd8241e2eb04f1ef2fab7b12a62503\":[600,-390],\"2a4de1c4e6095d1acb38c0eb608c9ac3\":[1095,-270],\"14e8c89b748d7ca2e4422e6fc986d796\":[285,-345]}","send_to_story_enabled":true,"entry_agent_guid":"ef0a9cb69b824154d1518770b7491b5d","exit_agent_guids":["be6b98ad5eec3c168fda0e86a8249e53"],"exit_agent_guid":"be6b98ad5eec3c168fda0e86a8249e53","form":{"name":"New story for tuckner329@gmail.com Form","description":"","fields":[],"visibility":"tenant","agent_guid":null,"success_message":"Thank you for your submission"}}],"form":{"name":"Tines Form","description":"","fields":[],"visibility":"tenant","agent_guid":null,"success_message":"Thank you for your submission"}}